---
kind: type
id: T:Autodesk.Revit.DB.Structure.LoadBase
source: html/4130f6dc-1963-2105-d85b-e08a7c34af8b.htm
---
# Autodesk.Revit.DB.Structure.LoadBase

The LoadBase object is the base class for all load objects within the Autodesk Revit API.
 Data members

## Syntax (C#)
```csharp
public class LoadBase : Element
```

## Remarks
Load objects are only available in Autodesk Revit Structure. This object contains methods that are common to all other load objects.